Revit 2022 API
Selection Methods
The Selection type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetElementIds
 Returns the ids of the elements that are currently selected.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
PickBox(PickBoxStyle)
 Invokes a general purpose two-click editor that lets the user to specify a rectangular area on the screen.
PickBox(PickBoxStyle, String)
 Invokes a general purpose two-click editor that lets the user to specify a rectangular area on the screen.
PickElementsByRectangle()
Prompts the user to select multiple elements by drawing a rectangle.
PickElementsByRectangle(String)
Prompts the user to select multiple elements by drawing a rectangle while showing a custom status prompt string.
PickElementsByRectangle(ISelectionFilter)
Prompts the user to select multiple elements by drawing a rectangle which pass a customer filter.
PickElementsByRectangle(ISelectionFilter, String)
Prompts the user to select multiple elements by drawing a rectangle which pass a customer filter while showing a custom status prompt string.
PickObject(ObjectType)
Prompts the user to select one object.
PickObject(ObjectType, ISelectionFilter)
Prompts the user to select one object which passes a custom filter.
PickObject(ObjectType, String)
Prompts the user to select one object while showing a custom status prompt string.
PickObject(ObjectType, ISelectionFilter, String)
Prompts the user to select one object which passes a custom filter while showing a custom status prompt string.
PickObjects(ObjectType)
Prompts the user to select multiple objects.
PickObjects(ObjectType, ISelectionFilter)
Prompts the user to select multiple objects which pass a customer filter.
PickObjects(ObjectType, String)
Prompts the user to select multiple objects while showing a custom status prompt string.
PickObjects(ObjectType, ISelectionFilter, String)
Prompts the user to select multiple objects which pass a custom filter while showing a custom status prompt string.
PickObjects(ObjectType, ISelectionFilter, String, IList<Reference>)
Prompts the user to select multiple objects which pass a custom filter while showing a custom status prompt string. A preselected set of objects may be supplied and will be selected at the start of the selection.
PickPoint()
Prompts the user to pick a point on the active work plane.
PickPoint(String)
Prompts the user to pick a point on the active work plane while showing a custom status prompt string.
PickPoint(ObjectSnapTypes)
Prompts the user to pick a point on the active work plane using specified snap settings.
PickPoint(ObjectSnapTypes, String)
Prompts the user to pick a point on the active work plane using specified snap settings while showing a custom status prompt string.
SetElementIds
 Selects the elements.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
Selection Class
Autodesk.Revit.UI.Selection Namespace